#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-development/runs/run-sFHD9y8DA293YPcV

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
aws_vpc.lab: Refreshing state... [id=vpc-050fed81aa0f29d48]
aws_subnet.lab-public-1: Refreshing state... [id=subnet-0b48628ea65382a63]
aws_internet_gateway.lab: Refreshing state... [id=igw-06ed2a62193e963f1]
aws_subnet.lab-public-0: Refreshing state... [id=subnet-0d02515b0457fefdf]
aws_subnet.lab-public-2: Refreshing state... [id=subnet-0f6895fd43a530bc1]
aws_lb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414165024142200000001/18670b423b265e61]
aws_security_group.lab: Refreshing state... [id=sg-0ec41d37ff810dd06]
aws_route_table.lab: Refreshing state... [id=rtb-06207beac90b549fd]
aws_instance.EC2-1: Refreshing state... [id=i-0927a00cacd2c3bdb]
aws_instance.EC2-2: Refreshing state... [id=i-0f96e653e83d565d1]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/my-alb/8cdcbf6c626c5def]
aws_instance.EC2-0: Refreshing state... [id=i-0f7a40f90d38096bc]
aws_lb_listener.alb_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:listener/app/my-alb/8cdcbf6c626c5def/edaff01b22e3d1d5]
aws_route_table_association.public-access-1: Refreshing state... [id=rtbassoc-02459a264e97911c5]
aws_route_table_association.public-access-0: Refreshing state... [id=rtbassoc-07d1f29440529aa5b]
aws_route_table_association.public-access-2: Refreshing state... [id=rtbassoc-0f186b7094111e39c]
aws_lb_target_group_attachment.lab-2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414165024142200000001/18670b423b265e61-20230414171104527400000005]
aws_lb_target_group_attachment.lab-0: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414165024142200000001/18670b423b265e61-20230414171104443700000004]
aws_lb_target_group_attachment.lab-1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414165024142200000001/18670b423b265e61-20230414171104613600000006]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.EC2-0 has changed
  ~ resource "aws_instance" "EC2-0" {
        id                                   = "i-0f7a40f90d38096bc"
      ~ security_groups                      = [
          - "sg-0ec41d37ff810dd06",
        ]
        tags                                 = {
            "Name" = "EC2-development-0"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_instance.EC2-1 has changed
  ~ resource "aws_instance" "EC2-1" {
        id                                   = "i-0927a00cacd2c3bdb"
      ~ security_groups                      = [
          - "sg-0ec41d37ff810dd06",
        ]
        tags                                 = {
            "Name" = "EC2-development-1"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_instance.EC2-2 has changed
  ~ resource "aws_instance" "EC2-2" {
        id                                   = "i-0f96e653e83d565d1"
      ~ security_groups                      = [
          - "sg-0ec41d37ff810dd06",
        ]
        tags                                 = {
            "Name" = "EC2-development-2"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_lb.alb has changed
  ~ resource "aws_lb" "alb" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/my-alb/8cdcbf6c626c5def"
        name                                        = "my-alb"
        tags                                        = {
            "Environment" = "dev"
        }
        # (22 unchanged attributes hidden)


      + subnet_mapping {
          + subnet_id = "subnet-0f6895fd43a530bc1"
        }
        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2-0 must be replaced
-/+ resource "aws_instance" "EC2-0" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-0f7a40f90d38096bc" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0f7a40f90d38096bc" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-00f78ff0ec08c6c4a" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-149.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.149" -> (known after apply)
      ~ public_dns                           = "ec2-18-233-152-204.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.233.152.204" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0ec41d37ff810dd06",
        ]
        tags                                 = {
            "Name" = "EC2-development-0"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ec41d37ff810dd06",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0635fc70df2ea902c" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.EC2-1 must be replaced
-/+ resource "aws_instance" "EC2-1" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-0927a00cacd2c3bdb" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0927a00cacd2c3bdb" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-009c1545b0448a63e" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-14.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.14" -> (known after apply)
      ~ public_dns                           = "ec2-3-90-203-197.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.90.203.197" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0ec41d37ff810dd06",
        ]
        tags                                 = {
            "Name" = "EC2-development-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ec41d37ff810dd06",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0aa092d1ceec17745" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.EC2-2 must be replaced
-/+ resource "aws_instance" "EC2-2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-0f96e653e83d565d1" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0f96e653e83d565d1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-059da57f240cfd4ac" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-102.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.102" -> (known after apply)
      ~ public_dns                           = "ec2-54-152-92-250.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.152.92.250" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0ec41d37ff810dd06",
        ]
        tags                                 = {
            "Name" = "EC2-development-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ec41d37ff810dd06",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-007395f1201fbed5e" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_lb.alb will be updated in-place
  ~ resource "aws_lb" "alb" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/my-alb/8cdcbf6c626c5def"
        name                                        = "my-alb"
      ~ tags                                        = {
          ~ "Environment" = "dev" -> "development"
        }
      ~ tags_all                                    = {
          ~ "Environment" = "dev" -> "development"
        }
        # (21 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

  # aws_lb_target_group_attachment.lab-0 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-0" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414165024142200000001/18670b423b265e61-20230414171104443700000004" -> (known after apply)
      ~ target_id        = "i-0f7a40f90d38096bc" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-1 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414165024142200000001/18670b423b265e61-20230414171104613600000006" -> (known after apply)
      ~ target_id        = "i-0927a00cacd2c3bdb" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-2 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-2" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414165024142200000001/18670b423b265e61-20230414171104527400000005" -> (known after apply)
      ~ target_id        = "i-0f96e653e83d565d1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.


```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*